content/posts/Physics_and_geometry_by_Edward_Witten_in_1986.md
+++
title = "Physics and geometry by Edward Witten in 1986"
author = ["Cameron Smith"]
lastmod = 2020-09-24T22:39:47-04:00
slug = "Physics_and_geometry_by_Edward_Witten_in_1986"
draft = false
+++

## See also {#see-also}


### Originally referred here via [The Graph, Wall, Tome project of Eric Weinstein's Portal Community]({{< relref "The_Graph,_Wall,_Tome_project_of_Eric_Weinstein's_Portal_Community" >}}) {#originally-referred-here-via-the-graph-wall-tome-project-of-eric-weinstein-s-portal-community--the-graph-wall-tome-project-of-eric-weinstein-s-portal-community-dot-md}

<!--list-separator-->

-  A paragraph written by Edward Witten p. 280 in the 1986 Proceedings of the International Congress of Mathematicians and on p. 20 in [Physics and geometry by Edward Witten in 1986]({{< relref "Physics_and_geometry_by_Edward_Witten_in_1986" >}}) (see below) taken with update from [Eric Weinstein's](https://ericweinstein.org), [The Portal 'Graph, Wall, Tome project'](https://theportal.wiki/wiki/Graph,%5FWall,%5FTome)

    <!--list-separator-->

    -  If one wants to summarize our knowledge of physics in the briefest possible terms, there are really three fundamental observations

        <!--list-separator-->

        -  1. Space-time is a pseudo-Riemannian manifold, \\[M\\], endowed with a metric tensor and governed by geometrical laws

        <!--list-separator-->

        -  2. Over \\[M\\] is a principal \\[G\\]-bundle, \\[P\_G\\], with a non-Abelian structure group \\[G\\]

        <!--list-separator-->

        -  3. Fermions are sections of \\[\hat{S}\_+ \otimes V\_R \oplus \hat{S}\_\* \otimes V\_{\tilde{R}}\\]. \\[R\\] and \\[\tilde{R}\\] are not isomorphic, but should be complex linear representations of \\[G\\]

        <!--list-separator-->

        -  4. ? Higgs

    <!--list-separator-->

    -  All of this must be supplemented with the understanding that the geometrical laws obeyed by the metric tensor, the gauge fields, and the fermions are to be interpreted in quantum mechanical terms.


### [The geometry of physics by Theodore Frankel in 2012]({{< relref "The_geometry_of_physics_by_Theodore_Frankel_in_2012" >}}) {#the-geometry-of-physics-by-theodore-frankel-in-2012--the-geometry-of-physics-by-theodore-frankel-in-2012-dot-md}


### [Lectures on Geometrical Anatomy of Theoretical Physics by Frederic Schuller in 2015]({{< relref "Lectures_on_Geometrical_Anatomy_of_Theoretical_Physics_by_Frederic_Schuller_in_2015" >}}) {#lectures-on-geometrical-anatomy-of-theoretical-physics-by-frederic-schuller-in-2015--lectures-on-geometrical-anatomy-of-theoretical-physics-by-frederic-schuller-in-2015-dot-md}

<!--list-separator-->

-  In particular for a quick and straightforward definition of [principal bundle]({{< relref "principal_bundle" >}})


## 0. Introduction (p. 1, not numbered in monograph) {#0-dot-introduction--p-dot-1-not-numbered-in-monograph}


## 1. Particle physics in the 1980's (p. 5) {#1-dot-particle-physics-in-the-1980-s--p-dot-5}


### <https://firebasestorage.googleapis.com/v0/b/firescript-577a2.appspot.com/o/imgs%2Fapp%2Fcameronraysmith%2FhNgQjn4HYJ?alt=media&token=57d85883-12b0-45b6-8e57-fe743f0dc376> {#https-firebasestorage-dot-googleapis-dot-com-v0-b-firescript-577a2-dot-appspot-dot-com-o-imgs-2fapp-2fcameronraysmith-2fhngqjn4hyj-alt-media-and-token-57d85883-12b0-45b6-8e57-fe743f0dc376}


### Brief notational reference {#brief-notational-reference}

<!--list-separator-->

-  \\[M\\], spacetime manifold

<!--list-separator-->

-  \\[X\\], principal \\[G\\]-bundle [principal bundle]({{< relref "principal_bundle" >}})

<!--list-separator-->

-  \\[G\\], structure group

<!--list-separator-->

-  \\[R\\], representation of \\[G\\] or, independently, the Ricci scalar or Ricci tensor

<!--list-separator-->

-  \\[V\_R\\], associated vector bundle of \\[X\\]

<!--list-separator-->

-  \\[A\\], connection on the bundle \\[V\\]

<!--list-separator-->

-  \\[F\\], curvature two form corresponding to \\[A\\]

<!--list-separator-->

-  \\[g\_{ij}\\], the space-time metric

<!--list-separator-->

-  \\[\langle | \rangle\\] is the Cartan-Killing form on the Lie algebra of \\[G\\]

<!--list-separator-->

-  \\[e\\] is the Yang-Mills coupling constant

<!--list-separator-->

-  \\[\Gamma^i\\], Dirac matrices

<!--list-separator-->

-  \\[\Sigma\\], Lorentz generators

<!--list-separator-->

-  \\[S\\], action or, independently, an irreducible spinor representation of the Clifford algebra of the Dirac matrices which is also of the Lorentz group in odd \\[n\\] and which double covers the Lorentz group in even \\[n\\]

<!--list-separator-->

-  \\[\hat{S}\\], the spin bundle of \\[M\\] whose fibers correspond to copies of the Clifford module \\[S\\]

<!--list-separator-->

-  \\[\psi\\], a spin one-half fermi field given as a section of the spin bundle \\[\hat{S}\\]


### Page 5 / 6 {#page-5-6}


### In general relativity, space-time is a pseudo-Riemannian manifold, \\[M\\] of signature \\[(-, +, +, +)\\]. The Einstein action (Lagrangian) is \\[S\_{GR} = \frac{1}{16 \pi G} \int\_M R\\] where \\[R\\] is the Ricci scalar of \\[M\\] and \\[G\\] is Newton's constant {#in-general-relativity-space-time-is-a-pseudo-riemannian-manifold-m-of-signature--plus-plus-plus--dot-the-einstein-action--lagrangian--is-s-gr-frac-1-16-pi-g-int-m-r-where-r-is-the-ricci-scalar-of-m-and-g-is-newton-s-constant}

<!--list-separator-->

-  The variational Euler-Lagrange equation derived from the Einstein action is \\[R\_{ij} \* \frac{1}{2} g\_{ij} R =0\\]


### Page 8 / 9 {#page-8-9}


### Over the spacetime manifold, \\[M\\], we have a principal \\[G\\]-bundle, \\[X\\] {#over-the-spacetime-manifold-m-we-have-a-principal-g-bundle-x}


### Page 9 / 10 {#page-9-10}


### Experimentally, the Lie algebra of \\[G\\] contains the Lie algebra of \\[SU(3) \times SU(2) \times U(1)\\] as a subalgebra. {#experimentally-the-lie-algebra-of-g-contains-the-lie-algebra-of-su--3--times-su--2--times-u--1--as-a-subalgebra-dot}


### The Yang-Mills action (Lagrangian) is \\[S\_{YM} = \* \frac{1}{4e^2} \int\_M |F|^2\\] {#the-yang-mills-action--lagrangian--is-s-ym-frac-1-4e-2-int-m-f-2}

<!--list-separator-->

-  Where \\[|F|^2 = g^{ii'}g^{jj'} \langle F\_{ij} | F\_{i'j'} \rangle\\]


### This should be the same metric \\[g\\] that appears in the Einstein field equation so that we should add the Einstein and Yang-Mills Lagrangians and study the combined theory {#this-should-be-the-same-metric-g-that-appears-in-the-einstein-field-equation-so-that-we-should-add-the-einstein-and-yang-mills-lagrangians-and-study-the-combined-theory}

<!--list-separator-->

-  \\[S=S\_{GR} + S\_{YM}\\]


### Equations that couple the Yang-Mills and gravitational fields arise upon deriving the Euler-Lagrange variational equations from this combined theory. {#equations-that-couple-the-yang-mills-and-gravitational-fields-arise-upon-deriving-the-euler-lagrange-variational-equations-from-this-combined-theory-dot}


### Page 10 / 11 {#page-10-11}


### This Yang-Mills and gravitational fields cover the bosonic force-propagating fields. It is also necessary to include fermions. {#this-yang-mills-and-gravitational-fields-cover-the-bosonic-force-propagating-fields-dot-it-is-also-necessary-to-include-fermions-dot}


### Fermions can be introduced via the Clifford algebra associated to the Dirac matrices {#fermions-can-be-introduced-via-the-clifford-algebra-associated-to-the-dirac-matrices}

<!--list-separator-->

-  \\[\Gamma^i \Gamma^j + \Gamma^j \Gamma^i = -2 g^{ij}, i,j = 1, \ldots, n\\]

<!--list-separator-->

-  For even \\[n\\], the irreducible representation \\[S\\] of the Clifford algebra has dimension \\[2^{n/2}\\] and for odd \\[n\\] its dimension is \\[2^{(n-1)/2}\\]

<!--list-separator-->

-  The Clifford module \\[S\\] automatically furnishes a representation of the Lorentz group \\[SO(1,n-1)\\] named the spinor representation whose Lorentz generators are

    <!--list-separator-->

    -  \\[\Sigma^{ij} = -\Sigma^{ji}=\frac{1}{4}[\Gamma^i, \Gamma^j]\\]

<!--list-separator-->

-  For even \\[n\\], \\[S\\] decomposes into \\[S = S\_+ \oplus S\_-\\] which are the eigenspaces of the involution

    <!--list-separator-->

    -  \\[\bar{\Gamma} = i^{(n+2)/4} \Gamma^1 \Gamma^2 \ldots \Gamma^n\\]

<!--list-separator-->

-  If the second Stiefel-Whitney class of \\[M\\] vanishes, we can define the spin bundle of \\[M\\] as \\[\hat{S}\\], which is the vector bundle whose bundle at fiber \\[p \in M\\] is the Clifford module associated to the Dirac matrices given above.

<!--list-separator-->

-  A physical field \\[\psi\\] is a section of \\[\hat{S}\\] called a spin one-half fermi field. These comprise the leptons (such as electrons, muons, tauons) and quarks (the components of protons and neutrons).

<!--list-separator-->

-  The spin one-half comes from the fact that the weights of the spinor representation of \\[SO(1, N-1)\\] are half-integers.

<!--list-separator-->

-  Page 11 / 12

<!--list-separator-->

-  In even dimensions, the spin bundle decomposes as \\[\hat{S} = \hat{S}\_+ \oplus \hat{S}\_-\\]. A physical field that is a section of \\[ \hat{S}\_+ \\] or \\[ \hat{S}\_\* \\] is a fermi field with the respective ****chirality****, \\[\pm\\].

<!--list-separator-->

-  Since the CPT theorem among others requires fermi fields to be real, in four dimensions, we introduce both \\[\psi\\] and \\[\tilde{\psi}\\] as sections of \\[ \hat{S}\_+ \\] or \\[ \hat{S}\_\* \\] . This would be true in all \\[4 k \\] dimensions but different in \\[4k+2\\] dimensions since in that case the \\[S\\] are both real.

<!--list-separator-->

-  Page 12 / 13

<!--list-separator-->

-  The Dirac equation takes the form

    <!--list-separator-->

    -  \\[D\_\* \psi\_+ + \lambda \psi\_\* = 0\\]

        \\[D\_+ \psi\_\* + \lambda^\* \psi\_+ = 0 \\]

        <!--list-separator-->

        -  For the so-called Dirac operator \\[D = \Gamma^i D\_i\\] where \\[D\_i\\] is the covariant derivative. This operator decomposes in even dimensions as \\[D = D\_+ \oplus D\_-\\] where \\[D\_\* \colon \hat{S}\_+ \rightarrow \hat{S}\_-\\] and \\[D\_+ \colon \hat{S}\_\* \rightarrow \hat{S}\_+\\]

        <!--list-separator-->

        -  and where \\[\lambda\\] is an arbitrary complex constant generalizing mass and potentially set to zero in the massless case

<!--list-separator-->

-  Page 14 / 15

<!--list-separator-->

-  The decomposition of a representation \\[R\\] of the gauge group \\[SU(3) \times SU(2) \times U(1)\\] into irreducible components seems to require at least 15 pieces

    <!--list-separator-->

    -  \\[R = \oplus\_{i=1}^{15} R\_i\\]

<!--list-separator-->

-  Page 17 / 18

<!--list-separator-->

-  Discussion of \\[SU(5)\\], \\[SO(10)\\] and \\[E(6)\\] [grand unified theories]({{< relref "grand_unified_theories" >}})


## 2. Physics in ten dimensions (p. 21) {#2-dot-physics-in-ten-dimensions--p-dot-21}


### There must be some more economical structure at a more elementary level. Also, it is very peculiar to study a chain that passes from \\[SU(5)\\] to \\[SO(10)\\] to \\[E\_6\\] without finding some way to extend this to \\[E\_8\\]. {#there-must-be-some-more-economical-structure-at-a-more-elementary-level-dot-also-it-is-very-peculiar-to-study-a-chain-that-passes-from-su--5--to-so--10--to-e-6-without-finding-some-way-to-extend-this-to-e-8-dot}


### the fact that all we observe in experiment is the character difference (33) or (36) is a warning that the true underlying structure may be far richer than is apparent. {#the-fact-that-all-we-observe-in-experiment-is-the-character-difference--33--or--36--is-a-warning-that-the-true-underlying-structure-may-be-far-richer-than-is-apparent-dot}


### At first sight, one might believe that it is preposterous to imagine that the world is ten dimensional. The world seems to be ‘obviously’ four dimensional (if one includes time along with the three obvious space dimensions). The following is crucial, however. We tend to take for granted that there is some notion of ‘empty space’ and that any other physical state is obtained by adding particles to ‘empty space.’ In reality, though, what we interpret.as empty space is just some solution of the underlying physical equations which plays a special role in our experience. The reason that there is a solution playing such a special role is largely that the energy scales of our experiments are so small compared to the Planck mass. The tools at our disposal are so feeble that we can bring about only minor disturbances in whatever solution of the underlying equations we happen to have been born into. {#at-first-sight-one-might-believe-that-it-is-preposterous-to-imagine-that-the-world-is-ten-dimensional-dot-the-world-seems-to-be-obviously-four-dimensional--if-one-includes-time-along-with-the-three-obvious-space-dimensions--dot-the-following-is-crucial-however-dot-we-tend-to-take-for-granted-that-there-is-some-notion-of-empty-space-and-that-any-other-physical-state-is-obtained-by-adding-particles-to-empty-space-dot-in-reality-though-what-we-interpret-dot-as-empty-space-is-just-some-solution-of-the-underlying-physical-equations-which-plays-a-special-role-in-our-experience-dot-the-reason-that-there-is-a-solution-playing-such-a-special-role-is-largely-that-the-energy-scales-of-our-experiments-are-so-small-compared-to-the-planck-mass-dot-the-tools-at-our-disposal-are-so-feeble-that-we-can-bring-about-only-minor-disturbances-in-whatever-solution-of-the-underlying-equations-we-happen-to-have-been-born-into-dot}


## 3. Quantum field theory on a Riemann surface (p. 31) {#3-dot-quantum-field-theory-on-a-riemann-surface--p-dot-31}


## 4. String theory (p. 46) [progress indicators]({{< relref "progress_indicators" >}}) {#4-dot-string-theory--p-dot-46--progress-indicators--progress-indicators-dot-md}


### 131 <https://en.wikipedia.org/wiki/Polyakov%5Faction> {#131-https-en-dot-wikipedia-dot-org-wiki-polyakov-action}
